
print(5)
print(type (5))
print(5+5)
print(5 - 5)
print( 5 * 5 )
print(5 / 5)
print(5 // 5) # целочисленное деление
print(5 % 5) # остаток от деления
print(5 % 2) # проверка четности (остаток от деления на 2)
print(8 % 2) # то же самое -четное если остаток равен 0
print(5 ** 2) # степень

# числа - НЕизменяемый тип данных и делятся на целые INT и с плавающей точкой FLOAT
# ----------------------------------------------------------------------------------

print('hello ORION')
print(type ('hello ORION')) # класс строковый STR  string
print('hello' + 'ORION')  # concatenate СЛОЖЕНИЕ СТРОК
print('he' + 'llo' +  ' ' + 'ORION')
#-------------------------------------------------------------------------------------

print(True, False) # класс BOOL логические Булевые числа 1 или 0
print(type (True))
print(1, 2, 102345, True, 'hello ORION', 5 > 10, 8 < 9)
print(5 > 5, 5 < 5, 5 == 5, 5 >= 5, 5 <= 5, 5 != 5)
print(5 > 10 and 5 < 10)
print(5 == 5 and 5 < 10)
print(5 > 10 or 5 < 10)
#--------------------------------------------------------------------------------------------

print(int ('5') + float ('4'))
print(type (int ('5')))






